//==========================================================================
//
//      fatfs_supp.c
//
//      FAT file system support functions
//
//==========================================================================
// ####ECOSGPLCOPYRIGHTBEGIN####                                            
// -------------------------------------------                              
// This file is part of eCos, the Embedded Configurable Operating System.   
// Copyright (C) 1998, 1999, 2000, 2001, 2002, 2003, 2004 Free Software Foundation, Inc.
//
// eCos is free software; you can redistribute it and/or modify it under    
// the terms of the GNU General Public License as published by the Free     
// Software Foundation; either version 2 or (at your option) any later      
// version.                                                                 
//
// eCos is distributed in the hope that it will be useful, but WITHOUT      
// ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or    
// FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License    
// for more details.                                                        
//
// You should have received a copy of the GNU General Public License        
// along with eCos; if not, write to the Free Software Foundation, Inc.,    
// 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.            
//
// As a special exception, if other files instantiate templates or use      

#define TENTRY_REGULAR  0 // Used when entry points to next file cluster 
#define TENTRY_FREE     1 // Free cluster
#define TENTRY_LAST     2 // Last cluster of file 
#define TENTRY_RESERVED 3 // Reserved cluster
#define TENTRY_BAD      4 // Bad cluster 

// -------------------------------------------------------------------------
// FAT table structures size 

#define DENTRY_SIZE 0x20 // Dir entry size

// -------------------------------------------------------------------------
// Time & date defines 

#define JD_1_JAN_1970 2440588 // 1 Jan 1970 in Julian day number

/*
 *  FAT directory entry field offset
 */
#define FAT_DENTRY_NAME      (0)
#define FAT_DENTRY_ATTR      (FAT_DENTRY_NAME + 11)
#define FAT_DENTRY_NTRES     (FAT_DENTRY_ATTR + 1)
#define FAT_DENTRY_CRT_TIME_TENTH   (FAT_DENTRY_NTRES + 1)
#define FAT_DENTRY_CRT_TIME  (FAT_DENTRY_CRT_TIME_TENTH + 1)
#define FAT_DENTRY_CRT_DATE  (FAT_DENTRY_CRT_TIME + 2)
#define FAT_DENTRY_ACC_DATE  (FAT_DENTRY_CRT_DATE + 2)
#define FAT_DENTRY_CLUS_HI   (FAT_DENTRY_ACC_DATE + 2)
#define FAT_DENTRY_WRT_TIME  (FAT_DENTRY_CLUS_HI + 2)
#define FAT_DENTRY_WRT_DATE  (FAT_DENTRY_WRT_TIME + 2)
#define FAT_DENTRY_CLUS_LO   (FAT_DENTRY_WRT_DATE + 2)
#define FAT_DENTRY_FILE_SIZE (FAT_DENTRY_CLUS_LO + 2)

#define FAT_LDENTRY_ORDER    (0)
#define FAT_LDENTRY_NAME1    (FAT_LDENTRY_ORDER + 1)
#define FAT_LDENTRY_ATTR     (FAT_LDENTRY_NAME1 + 10)
#define FAT_LDENTRY_TYPE     (FAT_LDENTRY_ATTR + 1)
#define FAT_LDENTRY_CHKSUM   (FAT_LDENTRY_TYPE + 1)
#define FAT_LDENTRY_NAME2    (FAT_LDENTRY_CHKSUM + 1)
#define FAT_LDENTRY_FST_CLUS_LO (FAT_LDENTRY_NAME2 + 12)
#define FAT_LDENTRY_NAME3    (FAT_LDENTRY_FST_CLUS_LO + 2)

#define FAT_ATTR_READ_ONLY  (0x01)
#define FAT_ATTR_HIDDEN     (0x02)
#define FAT_ATTR_SYSTEM     (0x04)
#define FAT_ATTR_VOLUME_ID  (0x08)
#define FAT_ATTR_DIRECTORY  (0x10)
#define FAT_ATTR_ARCHIVE    (0x20)
#define FAT_ATTR_LONG_NAME  (FAT_ATTR_READ_ONLY | \
                             FAT_ATTR_HIDDEN | \
                             FAT_ATTR_SYSTEM | \
                             FAT_ATTR_VOLUME_ID)
#define FAT_ATTR_LONG_NAME_MASK (FAT_ATTR_READ_ONLY | \
                                 FAT_ATTR_HIDDEN | \
                                 FAT_ATTR_SYSTEM | \
                                 FAT_ATTR_VOLUME_ID | \
                                 FAT_ATTR_DIRECTORY | \
                                 FAT_ATTR_ARCHIVE)


// -------------------------------------------------------------------------
// Code tracing defines 

#ifdef FATFS_TRACE_DIR_ENTRY
# define TDE 1
#else
# define TDE 0
#endif

#ifdef FATFS_TRACE_CLUSTER
# define TCL 1
#else
# define TCL 0
#endif

#ifdef FATFS_TRACE_DATA
# define TDO 1
# define TR(_args_)   diag_printf _args_ 
#else
# define TDO 0   
# define TR(_args_)  
#endif

//==========================================================================
// FAT structures 

// -------------------------------------------------------------------------
// FAT table boot record structure 
   
typedef struct fat_boot_record_s
{
    cyg_uint16    jump;           // 00h : Jump code
//  cyg_uint8     jump0;          //                 + NOP
    char          oem_name[8+1];  // 03h : OEM name
    cyg_uint16    bytes_per_sec;  // 0Bh : cyg_bytes per sector
    cyg_uint8     sec_per_clu;    // 0Dh : Sectors per cluster
    cyg_uint16    res_sec_num;    // 0Eh : Number of reserved sectors
    cyg_uint8     fat_tbls_num;   // 10h : Number of copies of fat
    cyg_uint16    max_root_dents; // 11h : Maximum number of root dir entries
    cyg_uint16    sec_num_32;     // 13h : Number of sectors in partition < 32MB
    cyg_uint8     media_desc;     // 15h : Media descriptor
    cyg_uint16    sec_per_fat;    // 16h : Sectors per FAT
    cyg_uint16    sec_per_track;  // 18h : Sectors per track
    cyg_uint16    heads_num;      // 1Ah : Number of heads
    cyg_uint32    hsec_num;       // 1Ch : Number of hidden sectors
    cyg_uint32    sec_num;        // 20h : Number of sectors in partition
    cyg_uint8     exe_marker[2];  // 1FEh: Executable marker (55h AAh)

// FAT32 specific fields
 
    cyg_uint32    sec_per_fat_32; // 24h : Sectors per FAT
    cyg_uint16    ext_flags;      // 28h : Flags
    cyg_uint16    fs_ver;         // 2Ah : FS version
    cyg_uint32    root_cluster;   // 2Ch : Root dir cluster
    cyg_uint16    fs_info_sec;    // 30h : Sector number of FSINFO structure
    cyg_uint16    bk_boot_sec;    // 32h : Sector number of backup boot record
//  cyg_uint8     reserved[12];   // 34h : Reserved

// Fields with different locations on FAT12/16 and FAT32 
        
    cyg_uint8     drv_num;        // 24h (40h) : Drive number of partition 
//  cyg_uint8     reserved1;      // 25h (41h) : Reserved 1
    cyg_uint8     ext_sig;        // 26h (42h) : Extended signature
    cyg_uint32    ser_num;        // 27h (43h) : Serial number of partition
    char          vol_name[11+1]; // 2Bh (47h) : Volume name of partition
    char          fat_name[8+1];  // 36h (52h) : FAT name
   
} fat_boot_record_t;

// -------------------------------------------------------------------------
// FAT dir entry structure 
 
typedef struct fat_raw_dir_entry_s
{
    char       name[8+1];   // 00h : Name
    char       ext[3+1];    // 08h : Extension
    cyg_uint8  attr;        // 0Bh : Attribute
    cyg_uint8  nt_reserved; // 0Ch : Win NT Reserved field
    cyg_uint8  crt_sec_100; // 0Dh : Creation time ms stamp 0 - 199
    cyg_uint16 crt_time;    // 0Eh : Creation time
    cyg_uint16 crt_date;    // 10h : Creation date
    cyg_uint16 acc_date;    // 12h : Last access date
    cyg_uint16 cluster_HI;  // 14h : Starting cluster HI WORD (FAT32)
    cyg_uint16 wrt_time;    // 16h : Time    
    cyg_uint16 wrt_date;    // 18h : Date
    cyg_uint16 cluster;     // 1Ah : Starting cluster 
    cyg_uint32 size;        // 1Ch : Size of the file    

    //for long file name.added by zhiqiang
    cyg_uint8 s_utf8[4*(FM_MAX_FILE_LEN+1)];
    cyg_uint8 uil_use_dent;
    cyg_uint16 ui2_len;
    cyg_uint32 ui4_name_off;
} fat_raw_dir_entry_t;
cyg_uint8 sec_per_cluster = 8;
cyg_uint32 sector_size = 512;


// -------------------------------------------------------------------------
// FAT cluster opts 
 
typedef enum cluster_opts_e
{
    CO_NONE       = 0x00, // NULL option
    CO_EXTEND     = 0x01, // Extend cluster chain if one cluster too short
    CO_ERASE_NEW  = 0x02, // Erase newly allocated cluster
    CO_MARK_LAST  = 0x04  // Mark  newly allocated cluster as last
} cluster_opts_t;

//==========================================================================
// Utility functions 
typedef cyg_uint16 UTF16;
typedef cyg_uint8 UTF8;
/*
	UCS-2    UTF-8 ֽ()
	0000 - 007F  0xxxxxxx
	0080 - 07FF 110xxxxx 10xxxxxx
	0800 - FFFF 1110xxxx 10xxxxxx 10xxxxxx
	*/
